/**
 * 
 */
/**
 * @author Teak
 * email : taekgyu0602@gmail.com
 *
 */
package Class_And_Object;

/*
1. 클래스와 객체
	클래스의 정의 - 객체를 정의해 놓은 것이다.
	클래스의 용도 - 객체를 생성하는데 사용된다.
	
	객체의 정의 - 실제로 존재하는 것, 사물 또는 개념
	객체의 용도 - 객체가 가지고 있는 기능과 속성에 따라 다름
	
	ex) 
	클래스/객체  =  제품 설계도/제품
				tv설계도/tv
				붕어빵기계/붕어빵
2. 객체와 인스턴스
	클래스로부터 객체를 만드는 과정을 클래스의 인스턴스화라고 하며,
	어떤 클래스로부터 만들어진 객체를 그 클래스의 인스턴스(instance)라고 한다.	
	
	죽, 객체는 모든 인스턴스를 대표하는 포괄적인 의미이며
	인스턴스는 어떤 클래스로부터 만들어진 것인지를 강조하는 구체적인 의미이다.

3. 객체의 구성요소 - 속성과 기능
	객체는 속성과 기능의 집합이다.
	속성(property) - 멤버변수(member variable), 특성(attribute), 필드(field), 상태(state)
	기능(function) - 메서드(method), 함수(function), 행위(behavior)

	ex) TV의 속성과 기능
	속성 - 크기, 길이, 높이, 색상, 볼륨, 채널 등
	기능 - 켜기, 끄기, 볼륨 높이기, 볼륨 낮추기, 채널 변경하기 등
	
	객체 지향 프로그래밍에서는 
	속성(property) -> 멤버변수(variable)
	기능(fucntion) -> 메서드(method)
	로 표현한다.
*/